function [t , Y] = BPSKmod (X, F_X,F_c,F_s)
%BPSK调制，输入为单极性序列 t时间轴，Y输出数据， X输入数据，F_X输入数据抽样频率，F_Carrier调制载波频率，F_s输出序列频率
% ***********************************************************************  
    L = length(X);
    N = F_s / F_X;                                   %计算一个基带码周期内，按F_s抽样N次
    N = round(N);                                    %保证N为整数
    temp = rectpulse(X, N);                          %将数字信号变为连续信号抽样后结果（生成矩形函数）
    t = (0 : N * L - 1) * 1 / F_s;                   %生成时间轴
    Y = (1 - 2 * temp) .* cos( 2 * pi * F_c * t);    %点乘
end
