function y = ds_mod(c,x)
%DSSS扩频 扩频序列_行=ds_mod（c=伪随机序列_行, x=输入信号_行) 
%*************************************************************************************
%			 c ---> user code (列向量)
%         x ---> input signal (行向量)
%         y ---> temp = c*x, y = tmp(:) (直接扩频序列，列向量)
% 输入信号每一位和扩频序列相乘构成一列，再按照列输出矩阵~
%***********************************************************************************
%     c = c';
%     tmp = c*x;
%     tmp2 = tmp(:);
%     y = tmp2';
%************************************************************************************
data1 = [];
for i = 1:length(x)
    if (x(i) == 1)
        temp = xor(ones(1,length(c)),c);
        data1 = [data1  temp];
    else
        temp = xor(zeros(1,length(c)),c);
        data1 = [data1  temp];
    end
end
y = data1;

end